humbertokramm/ht32sx/HT32SX-P2P-Coletor/HT_P2P_Demo/S2LP_Config/Inc/HT_P2P_s2lp_regs.h
/*

  _    _ _______   __  __ _____ _____ _____   ____  _   _
 | |  | |__   __| |  \/  |_   _/ ____|  __ \ / __ \| \ | |
 | |__| |  | |    | \  / | | || |    | |__) | |  | |  \| |
 |  __  |  | |    | |\/| | | || |    |  _  /| |  | | . ` |
 | |  | |  | |    | |  | |_| || |____| | \ \| |__| | |\  |
 |_|  |_|  |_|    |_|  |_|_____\_____|_|  \_\\____/|_| \_|
 =================== Advanced R&D ========================

 */

/*!
 * \file HT_P2P_s2lp_regs.h
 * \brief This file contains all the registers address and masks.
 * \author HT Micron Advanced R&D and STMicroelectronics
 * \link support_iot@htmicron.com.br
 * \version 2.2
 * \date September 29, 2020
 */

#ifndef __HT_P2P_S2LP_REGS_H__
#define __HT_P2P_S2LP_REGS_H__

/* Defines ------------------------------------------------------------------*/

/**
 * \brief GPIO0_CONF register
 * \code
 * Read and Write
 * Default value: 0x0A
 * 7:3 GPIO_SELECT: Specify the GPIO0 I/O signal, default setting POR.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO0 Mode:,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO0_CONF_ADDR			((uint8_t)0x00)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO1_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO1 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO1 Mode:,  01b: Digital Input1,  0b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO1_CONF_ADDR			((uint8_t)0x01)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO2_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO2 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO2 Mode:,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO2_CONF_ADDR			((uint8_t)0x02)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief GPIO3_CONF register
 * \code
 * Read and Write
 * Default value: 0xA2
 * 7:3 GPIO_SELECT: Specify the GPIO3 I/O signal, default setting digital GND.
 * 2 RESERVED: -
 * 1:0 GPIO_MODE: GPIO3 Mode:,  00b: Analog,  01b: Digital Input,  10b: Digital Output Low Power,  11b: Digital Output High Power
 * \endcode
 */
#define GPIO3_CONF_ADDR			((uint8_t)0x03)

#define GPIO_SELECT_REGMASK			((uint8_t)0xF8)
#define GPIO_MODE_REGMASK			((uint8_t)0x03)


/**
 * \brief MCU_CK_CONF register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7 EN_MCU_CLK: 1: The internal divider logic is running, so the MCU clock is available (but proper GPIO configuration is needed)
 * 6:5 CLOCK_TAIL: Number of extra clock cycles provided to the MCU before switching to STANDBY state.,  00b: 0 extra clock cycle,  01b: 64 extra clock cycles,  10b: 256 extra clock cycles,  11b: 512 extra clock cycles
 * 4:1 XO_RATIO: Divider for the XO clock output
 * 0 RCO_RATIO: Divider for the RCO clock output,  0: 1 , 1: 1/128
 * \endcode
 */
#define MCU_CK_CONF_ADDR			((uint8_t)0x04)

#define EN_MCU_CLK_REGMASK			((uint8_t)0x80)
#define CLOCK_TAIL_REGMASK			((uint8_t)0x60)
#define XO_RATIO_REGMASK			((uint8_t)0x1E)
#define RCO_RATIO_REGMASK			((uint8_t)0x01)


/**
 * \brief SYNT3 register
 * \code
 * Read and Write
 * Default value: 0x42
 * 7:5 PLL_CP_ISEL: Set the charge pump current according to the XTAL frequency.
 * 4 BS: Synthesizer band select. This parameter selects the out-of loop divide factor of the synthesizer:,  0: 4, band select factor for high band,  1: 8, band select factor for middle band.
 * 3:0 SYNT_27_24: MSB bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT3_ADDR			((uint8_t)0x05)

#define PLL_CP_ISEL_REGMASK			((uint8_t)0xE0)
#define BS_REGMASK			((uint8_t)0x10)
#define SYNT_27_24_REGMASK			((uint8_t)0x0F)


/**
 * \brief SYNT2 register
 * \code
 * Read and Write
 * Default value: 0x16
 * 7:0 SYNT[23:16]: Intermediate bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT2_ADDR			((uint8_t)0x06)

#define SYNT_23_16_REGMASK			((uint8_t)0xFF)


/**
 * \brief SYNT1 register
 * \code
 * Read and Write
 * Default value: 0x27
 * 7:0 SYNT[15:8]: Intermediate bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT1_ADDR			((uint8_t)0x07)

#define SYNT_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief SYNT0 register
 * \code
 * Read and Write
 * Default value: 0x62
 * 7:0 SYNT[7:0]: LSB bits of the PLL programmable divider.
 * \endcode
 */
#define SYNT0_ADDR			((uint8_t)0x08)

#define SYNT_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief IF_OFFSET_ANA register
 * \code
 * Read and Write
 * Default value: 0x2A
 * 7:0 IF_OFFSET_ANA: Intermediate frequency setting for the analog RF synthesizer, default: 300 kHz.
 * \endcode
 */
#define IF_OFFSET_ANA_ADDR			((uint8_t)0x09)

#define IF_OFFSET_ANA_REGMASK			((uint8_t)0xFF)


/**
 * \brief IF_OFFSET_DIG register
 * \code
 * Read and Write
 * Default value: 0xB8
 * 7:0 IF_OFFSET_DIG: Intermediate frequency setting for the digital shift-to-baseband circuits, default: 300 kHz.
 * \endcode
 */
#define IF_OFFSET_DIG_ADDR			((uint8_t)0x0A)

#define IF_OFFSET_DIG_REGMASK			((uint8_t)0xFF)


/**
 * \brief CH_SPACE register
 * \code
 * Read and Write
 * Default value: 0x3F
 * 7:0 CH_SPACE: Channel spacing. From ~793Hz to ~200KHz in 793Hz steps, default 100kHz.
 * \endcode
 */
#define CH_SPACE_ADDR			((uint8_t)0x0C)

#define CH_SPACE_REGMASK			((uint8_t)0xFF)


/**
 * \brief CHNUM register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 CH_NUM: Channel number. This value is multiplied by the channel spacing and added to the synthesizer base frequency to generate the actual RF carrier frequency.
 * \endcode
 */
#define CHNUM_ADDR			((uint8_t)0x0D)

#define CH_NUM_REGMASK			((uint8_t)0xFF)


/**
 * \brief MOD4 register
 * \code
 * Read and Write
 * Default value: 0x83
 * 7:0 DATARATE_M[15:8]: The MSB of the mantissa value of the data rate equation, default 38.4 ksps.
 * \endcode
 */
#define MOD4_ADDR			((uint8_t)0x0E)

#define DATARATE_M_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief MOD3 register
 * \code
 * Read and Write
 * Default value: 0x2B
 * 7:0 DATARATE_M[7:0]: The LSB of the mantissa value of the data rate equation, default 38.4 ksps.
 * \endcode
 */
#define MOD3_ADDR			((uint8_t)0x0F)

#define DATARATE_M_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief MOD2 register
 * \code
 * Read and Write
 * Default value: 0x77
 * 7:4 MOD_TYPE: Modulation type:,  0: 2-FSK,  1: 4-FSK,  2: 2-GFSK BT=1,  3: 4-GFSK BT=1,  5: ASK/OOK,  7: unmodulated,  10: 2-GFSK BT=0.5,  12: 4-GFSK BT=0.5
 * 3:0 DATARATE_E: The exponent value of the data rate equation, default 38.4 ksps.
 * \endcode
 */
#define MOD2_ADDR			((uint8_t)0x10)

#define MOD_TYPE_REGMASK			((uint8_t)0xF0)
#define DATARATE_E_REGMASK			((uint8_t)0x0F)


/**
 * \brief MOD1 register
 * \code
 * Read and Write
 * Default value: 0x03
 * 7 PA_INTERP_EN: 1: enable the power interpolator
 * 6 MOD_INTERP_EN: 1: enable frequency interpolator
 * 5:4 G4FSK_CONST_MAP: Select the constellation map for 4-GFSK.
 * 3:0 FDEV_E: The exponent value of the frequency deviation equation, default 20 kHz.
 * \endcode
 */
#define MOD1_ADDR			((uint8_t)0x11)

#define PA_INTERP_EN_REGMASK			((uint8_t)0x80)
#define MOD_INTERP_EN_REGMASK			((uint8_t)0x40)
#define G4FSK_CONST_MAP_REGMASK			((uint8_t)0x30)
#define FDEV_E_REGMASK			((uint8_t)0x0F)


/**
 * \brief MOD0 register
 * \code
 * Read and Write
 * Default value: 0x93
 * 7:0 FDEV_M: The mantissa value of the frequency deviation equation, default 20 kHz.
 * \endcode
 */
#define MOD0_ADDR			((uint8_t)0x12)

