humbertokramm/ht32sx/HT32SX-P2P-Coletor/HT_P2P_Demo/S2LP_Config/Inc/HT_P2P_s2lp_regs.h
#define PA_LEVEL_1_REGMASK			((uint8_t)0x7F)


/**
 * \brief PA_POWER0 register
 * \code
 * Read and Write
 * Default value: 0x47
 * 7 DIG_SMOOTH_EN: 1: enable the generation of the internal signal TX_DATA which is the input of the FIR.
 * 6 PA_MAXDBM: 1: configure the PA to send maximum output power.
 * 5 PA_RAMP_EN: 1: enable the power ramping
 * 4:3 PA_RAMP_STEP_LEN: Set the step width (unit: 1/8 of bit period).
 * 2:0 PA_LEVEL_MAX_IDX: Final level for power ramping or selected output power index.
 * \endcode
 */
#define PA_POWER0_ADDR			((uint8_t)0x62)

#define DIG_SMOOTH_EN_REGMASK			((uint8_t)0x80)
#define PA_MAXDBM_REGMASK			((uint8_t)0x40)
#define PA_RAMP_EN_REGMASK			((uint8_t)0x20)
#define PA_RAMP_STEP_LEN_REGMASK			((uint8_t)0x18)
#define PA_LEVEL_MAX_IDX_REGMASK			((uint8_t)0x07)


/**
 * \brief PA_CONFIG1 register
 * \code
 * Read and Write
 * Default value: 0x03
 * 7:5 RESERVED: -
 * 4 LIN_NLOG: 1: enable the linear-to-log conversion of the PA code output.
 * 3:2 FIR_CFG: FIR configuration: 00b: filtering, 01b : ramping, 10b: switching.
 * 1 FIR_EN: 1: enable FIR.
 * 0 RESERVED: -
 * \endcode
 */
#define PA_CONFIG1_ADDR			((uint8_t)0x63)

#define LIN_NLOG_REGMASK			((uint8_t)0x10)
#define FIR_CFG_REGMASK			((uint8_t)0xC0)
#define FIR_EN_REGMASK			((uint8_t)0x02)


/**
 * \brief SYNTH_CONFIG2 register
 * \code
 * Read and Write
 * Default value: 0xD0
 * 7 RESERVED: -
 * 6 RESERVED: -
 * 5 RESERVED: -
 * 4:3 RESERVED: -
 * 2 PLL_PFD_SPLIT_EN: Enables increased DN current pulses to improve linearization of CP/PFD.
 * 1:0 RESERVED: -
 * \endcode
 */
#define SYNTH_CONFIG2_ADDR			((uint8_t)0x65)

#define PLL_PFD_SPLIT_EN_REGMASK			((uint8_t)0x04)


/**
 * \brief VCO_CONFIG register
 * \code
 * Read and Write
 * Default value: 0x02
 * 7:6 RESERVED: -
 * 5 VCO_CALAMP_EXT_SEL: 1 --> VCO amplitude calibration will be skipped (external amplitude word forced on VCO).
 * 4 VCO_CALFREQ_EXT_SEL: 1 --> VCO frequency calibration will be skipped (external amplitude word forced on VCO).
 * 3 RESERVED: -
 * 2:0 RESERVED: -
 * \endcode
 */
#define VCO_CONFIG_ADDR			((uint8_t)0x68)

#define VCO_CALAMP_EXT_SEL_REGMASK			((uint8_t)0x20)
#define VCO_CALFREQ_EXT_SEL_REGMASK			((uint8_t)0x20)


/**
 * \brief VCO_CALIBR_IN2 register
 * \code
 * Read and Write
 * Default value: 0x88
 * 7:4 VCO_CALAMP_TX: VCO magnitude calibration word (binary coding to be internally converted in thermometric code) used in TX.
 * 3:0 VCO_CALAMP_RX: VCO magnitude calibration word (binary coding to be internally converted in thermometric code) used in RX.
 * \endcode
 */
#define VCO_CALIBR_IN2_ADDR			((uint8_t)0x69)

#define VCO_CALAMP_TX_REGMASK			((uint8_t)0xF0)
#define VCO_CALAMP_RX_REGMASK			((uint8_t)0x0F)


/**
 * \brief VCO_CALIBR_IN1 register
 * \code
 * Read and Write
 * Default value: 0x40
 * 7 RESERVED: -
 * 6:0 VCO_CALFREQ_TX: VCO Cbank frequency calibration word to be used in TX.
 * \endcode
 */
#define VCO_CALIBR_IN1_ADDR			((uint8_t)0x6A)

#define VCO_CALFREQ_TX_REGMASK			((uint8_t)0x7F)


/**
 * \brief VCO_CALIBR_IN0 register
 * \code
 * Read and Write
 * Default value: 0x40
 * 7 RESERVED: -
 * 6:0 VCO_CALFREQ_RX: VCO Cbank frequency calibration word to be used in RX.
 * \endcode
 */
#define VCO_CALIBR_IN0_ADDR			((uint8_t)0x6B)

#define VCO_CALFREQ_RX_REGMASK			((uint8_t)0x7F)


/**
 * \brief XO_RCO_CONF1 register
 * \code
 * Read and Write
 * Default value: 0x6C
 * 7:6 RESERVED: -
 * 5 RESERVED: -
 * 4 PD_CLKDIV: 1: disable both dividers of digital clock (and reference clockfor the SMPS) and IF-ADC clock.
 * 3:2 RESERVED: -
 * 1:0 RESERVED: -
 * \endcode
 */
#define XO_RCO_CONF1_ADDR			((uint8_t)0x6C)

#define PD_CLKDIV_REGMASK			((uint8_t)0x10)


/**
 * \brief XO_RCO_CONF0 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 EXT_REF: 0: reference signal from XO circuit, 1: reference signal from XIN pin.
 * 5:4 GM_CONF: Set the driver gm of the XO at start up.
 * 3 REFDIV: 1: enable the the reference clock divider.
 * 2 RESERVED: -
 * 1 EXT_RCO_OSC: 1: the 34.7 kHz signal must be supplied from any GPIO.
 * 0 RCO_CALIBRATION: 1: enable the automatic RCO calibration.
 * \endcode
 */
#define XO_RCO_CONF0_ADDR			((uint8_t)0x6D)

#define EXT_REF_REGMASK			((uint8_t)0x80)
#define GM_CONF_REGMASK			((uint8_t)0x70)
#define REFDIV_REGMASK			((uint8_t)0x08)
#define EXT_RCO_OSC_REGMASK			((uint8_t)0x02)
#define RCO_CALIBRATION_REGMASK			((uint8_t)0x01)


/**
 * \brief RCO_CALIBR_CONF3 register
 * \code
 * Read and Write
 * Default value: 0x70
 * 7:4 RWT_IN: RWT word value for the RCO.
 * 3:0 RFB_IN_4_1: MSB part of RFB word value for RCO.
 * \endcode
 */
#define RCO_CALIBR_CONF3_ADDR			((uint8_t)0x6E)

#define RWT_IN_REGMASK			((uint8_t)0xF0)
#define RFB_IN_4_1_REGMASK			((uint8_t)0x0F)


/**
 * \brief RCO_CALIBR_CONF2 register
 * \code
 * Read and Write
 * Default value: 0x4D
 * 7 RFB_IN[0]: LSB part of RFB word value for RCO.
 * 6:4 RESERVED: -
 * 6:4 RESERVED: -
 * 3 RESERVED: -
 * 2:0 RESERVED: -
 * \endcode
 */
#define RCO_CALIBR_CONF2_ADDR			((uint8_t)0x6F)

#define RFB_IN_0_REGMASK			((uint8_t)0x80)


/**
 * \brief PM_CONF4 register
 * \code
 * Read and Write
 * Default value: 0x17
 * 7 TEMP_SENSOR_EN: 1: enable the temperature sensor.
 * 6 TEMP_SENS_BUFF_EN: 1: enable the output buffer for the temperature sensor.
 * 5 EXT_SMPS: 1: disable the internal SMPS.
 * 4 RESERVED: -
 * 3 RESERVED: -
 * 2 RESERVED: -
 * 1:0 RESERVED: -
 * \endcode
 */
#define PM_CONF4_ADDR			((uint8_t)0x75)

#define TEMP_SENSOR_EN_REGMASK			((uint8_t)0x80)
#define TEMP_SENS_BUFF_EN_REGMASK			((uint8_t)0x40)
#define EXT_SMPS_REGMASK			((uint8_t)0x20)


/**
 * \brief PM_CONF3 register
 * \code
 * Read and Write
 * Default value: 0x20
 * 7 KRM_EN: 0: divider by 4 enabled (SMPS' switching frequency is FSW=FCLK/4), 1: rate multiplier enabled (SMPS' switching frequency is FSW=KRM*FOSC/(2^15).
 * 6:0 KRM_14_8: Sets the divider ratio (MSB) of the rate multiplier (default: FSW=FCLK/4)
 * \endcode
 */
#define PM_CONF3_ADDR			((uint8_t)0x76)

#define KRM_EN_REGMASK			((uint8_t)0x80)
#define KRM_14_8_REGMASK			((uint8_t)0x7F)


/**
 * \brief PM_CONF2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 KRM[7:0]: Sets the divider ratio (LSB) of the rate multiplier (default: FSW=FCLK/4)
 * \endcode
 */
#define PM_CONF2_ADDR			((uint8_t)0x77)

#define KRM_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief PM_CONF1 register
 * \code
 * Read and Write
 * Default value: 0x39
 * 7 RESERVED: -
 * 6 BATTERY_LVL_EN: 1: enable battery level detector circuit.
 * 5:4 SET_BLD_TH: Set the BLD threshold: 00b: 2.7V, 01b: 2.5V, 10b: 2.3V, 00b: 2.1V.
 * 3 RESERVED: -
 * 2 RESERVED: -
 * 1 RESERVED: -
 * 0 RESERVED: -
 * \endcode
 */
#define PM_CONF1_ADDR			((uint8_t)0x78)

